namespace MarketSimulator
{
    internal class Program
    {
        //Розробити програму, яка б симулювала покупців у магазині з наступними вимогами:

        //[+] В системі буде декілька покупців.Кількість покупців вводить користувач з консолі.
        //[+] Кожен покупець має картку з його номером(випадкове число від 1 до 1000, для цього можете використовувати  Random rnd = new Random(); rnd.next(1000)
        //[+] У кожного покупця є стартова кількість грошей(також випадкове число від 1000 до 10_000)
        //[] В магазині є багато різних видів товарів(описані в коді) та є кількість прибутку(спочатку дорівнює 0 )
        //[] Кожен товар має назву, ціну, кількість у магазині. (усі кількості - описані в коді чи можете використати генератор випадкових чисел)
        //[] коли покупець покупає товар -кількість товару зменшується на одиницю, гроші покупця зменщуются на ціну товару, прибуток магазину зростає на ціну товара.
        //[] Зробіть так щоб покупці покупали товари до тих пір поки в них є гроші чи не закінчилися товари
        //[] вкінкці програми вивесту прибуток магазину та номер картки покупця що купив максимальну кількість товарів та картку покупця що витратив найбільшу кількість грошей
        //[] Для виконання роботи використовуйте класи. структури та функції для організації коду. 
        static void Main(string[] args)
        {
            Console.OutputEncoding = System.Text.Encoding.UTF8;

            Random rnd = new Random();
            Console.Write("Введіть кількість покупців: ");
            string? input = Console.ReadLine();

            if(input == null) return;

            int numberOfCustomers = int.Parse(input);

            //створення користувачів
            List<Customer> customers = new List<Customer>();
            for (int i = 0; i < numberOfCustomers; i++)
            {
                int cardNumber = rnd.Next(1, 1001);
                int money = rnd.Next(1000, 10001);
                Customer customer = new Customer(cardNumber, money);
                customers.Add(customer);
            }
            //
        }
    }
}
